enum blogPostCategory {
  News,
  Opinion,
}

export interface blogPost {
  id: number;
  title: string;
  description: string;
  imageUrl?: string;
  category: blogPostCategory;
  author: string;
  timesReadCounter: number;
}

export const posts: blogPost[] = [
    {
        id: 1,
        title: 'Παναθηναϊκός: Η προπόνηση τελείωσε, αλλά ο Αϊτόρ συνέχισε!',
        description: 'Ο Ισπανός εξτρέμ είναι ο απόλυτος πρωταγωνιστής του Παναθηναϊκού \
        στις πρώτες πέντε αγωνιστικές του πρωταθλήματος έχοντας μάλιστα πετύχει πέντε γκολ \
        ενώ έχει μοιράσει δύο ασίστ. Μάλιστα στο τελευταίο εντός έδρας παιχνίδι με τον ΠΑΣ Γιάννινα \
        πέτυχε χατ - τρικ, με τα δύο από τα τρία τέρματα να τα πετυχαίνει με απευθείας εκτελέσεις φάουλ. \
        Παρά το γεγονός ότι ο Αϊτόρ είναι ιδιαίτερα φορμαρισμένος το τελευταίο χρονικό διάστημα δεν σταματάει να δουλεύει. \
        Για την ακρίβεια, μετά το τέλος της σημερινής προπόνησης, ο Αϊτόρ Κανταλαπιέδρα κάθισε και εξασκήθηκε στις εκτελέσεις φάουλ. \
        Άλλωστε όπως ανέφερε και στην αποκλειστική του συνέντευξη στο SDNA ο Ισπανός μέσος:  «Κι όταν τα πράγματα πηγαίνουν καλά, \
        τότε πρέπει να δουλέψεις ακόμα σκληρότερα για να βελτιωθείς»',
        category: blogPostCategory.News,
        imageUrl: 'https://www.sdna.gr/sites/default/files/styles/main/public/2022-09/3603649.jpg?h=17e28838&itok=Cq7zVvk2',
        author: 'Θάνος Νικολογιάννης',
        timesReadCounter: 3
    },
    {
        id: 2,
        title: 'Παναθηναϊκός: Επέστρεψε στις προπονήσεις ο Κώτσιρας και.... φουλάρει για Τούμπα!',
        description: 'Ο Γιάννης Κώτσιρας επέστρεψε σε κανονικό ρυθμό προπονήσεων και ανεβάζει στροφές προκειμένου να είναι \
        έτοιμος για Τούμπα. Μπήκε κανονικά και ο Παλάσιος. Την προετοιμασία του για την αναμέτρηση με τον ΠΑΟΚ συνέχισε την \
        Τετάρτη ο Παναθηναϊκός. Ο Ιβάν Γιοβάνοβιτς είδε τον Γιάννη Κώτσιρα να επιστρέφει σε κανονικό ρυθμό προπονήσεων, \
        μετά τον τραυματισμό στο οπίσθιο μηριαίο που τον άφησε εκτός για 10 μέρες. Ο δεξιός μπακ του τριφυλλιού δεν αντιμετώπισε \
        κανένα απολύτως πρόβλημα και ανεβάζει στροφές, με σκοπό να είναι έτοιμος για την αναμέτρηση της Κυριακής με τον ΠΑΟΚ στην Τούμπα. \
        Την ίδια στιγμή κανονικά προπονήθηκε και ο Σεμπάστιαν Παλάσιος, ο οποίος τις προηγούμενες μέρες ακολουθούσε πρόγραμμα αποφόρτισης. \
        Επιπρόσθετα, οι Έλληνες διεθνείς (Κουρμπέλης, Ιωαννίδης) επέστρεψαν στο Κορωπί και έκαναν αποθεραπεία, μιας και αγωνίστηκαν στη χθεσινή \
        αναμέτρηση της χώρας μας με την Βόρεια Ιρλανδία. Αξίζει να σημειωθεί ότι αύριο αναμένεται να επιστρέψουν \
        οι Σπόραρ, Τσέριν, Βέρμπιτς, Μάγκνουσον, Τσόκαϊ.',
        category: blogPostCategory.News,
        imageUrl: 'https://www.sdna.gr/sites/default/files/styles/main/public/2022-09/3377968_161009.jpg?itok=EX9LWBQ9',
        author: 'Τάσος Νικολογιάννης',
        timesReadCounter: 13
    },
]

